RT-Thread/rt-thread/bsp/freescale/platform/devices/MK10D10/include/MK10D10_extension.h
/*
 * Constants & macros for individual CRC_CRC bitfields
 */

/*!
 * @name Register CRC_CRC, field LL[7:0] (RW)
 *
 * When CTRL[WAS] is 1, values written to this field are part of the seed value.
 * When CTRL[WAS] is 0, data written to this field is used for CRC checksum
 * generation.
 */
/*@{*/
/*! @brief Read current value of the CRC_CRC_LL field. */
#define CRC_RD_CRC_LL(base)  ((CRC_CRC_REG(base) & CRC_CRC_LL_MASK) >> CRC_CRC_LL_SHIFT)
#define CRC_BRD_CRC_LL(base) (CRC_RD_CRC_LL(base))

/*! @brief Set the LL field to a new value. */
#define CRC_WR_CRC_LL(base, value) (CRC_RMW_CRC(base, CRC_CRC_LL_MASK, CRC_CRC_LL(value)))
#define CRC_BWR_CRC_LL(base, value) (CRC_WR_CRC_LL(base, value))
/*@}*/

/*!
 * @name Register CRC_CRC, field LU[15:8] (RW)
 *
 * When CTRL[WAS] is 1, values written to this field are part of the seed value.
 * When CTRL[WAS] is 0, data written to this field is used for CRC checksum
 * generation.
 */
/*@{*/
/*! @brief Read current value of the CRC_CRC_LU field. */
#define CRC_RD_CRC_LU(base)  ((CRC_CRC_REG(base) & CRC_CRC_LU_MASK) >> CRC_CRC_LU_SHIFT)
#define CRC_BRD_CRC_LU(base) (CRC_RD_CRC_LU(base))

/*! @brief Set the LU field to a new value. */
#define CRC_WR_CRC_LU(base, value) (CRC_RMW_CRC(base, CRC_CRC_LU_MASK, CRC_CRC_LU(value)))
#define CRC_BWR_CRC_LU(base, value) (CRC_WR_CRC_LU(base, value))
/*@}*/

/*!
 * @name Register CRC_CRC, field HL[23:16] (RW)
 *
 * In 16-bit CRC mode (CTRL[TCRC] is 0), this field is not used for programming
 * a seed value. In 32-bit CRC mode (CTRL[TCRC] is 1), values written to this
 * field are part of the seed value when CTRL[WAS] is 1. When CTRL[WAS] is 0, data
 * written to this field is used for CRC checksum generation in both 16-bit and
 * 32-bit CRC modes.
 */
/*@{*/
/*! @brief Read current value of the CRC_CRC_HL field. */
#define CRC_RD_CRC_HL(base)  ((CRC_CRC_REG(base) & CRC_CRC_HL_MASK) >> CRC_CRC_HL_SHIFT)
#define CRC_BRD_CRC_HL(base) (CRC_RD_CRC_HL(base))

/*! @brief Set the HL field to a new value. */
#define CRC_WR_CRC_HL(base, value) (CRC_RMW_CRC(base, CRC_CRC_HL_MASK, CRC_CRC_HL(value)))
#define CRC_BWR_CRC_HL(base, value) (CRC_WR_CRC_HL(base, value))
/*@}*/

/*!
 * @name Register CRC_CRC, field HU[31:24] (RW)
 *
 * In 16-bit CRC mode (CTRL[TCRC] is 0) this field is not used for programming a
 * seed value. In 32-bit CRC mode (CTRL[TCRC] is 1) values written to this field
 * are part of the seed value when CTRL[WAS] is 1. When CTRL[WAS] is 0, data
 * written to this field is used for CRC checksum generation in both 16-bit and
 * 32-bit CRC modes.
 */
/*@{*/
/*! @brief Read current value of the CRC_CRC_HU field. */
#define CRC_RD_CRC_HU(base)  ((CRC_CRC_REG(base) & CRC_CRC_HU_MASK) >> CRC_CRC_HU_SHIFT)
#define CRC_BRD_CRC_HU(base) (CRC_RD_CRC_HU(base))

/*! @brief Set the HU field to a new value. */
#define CRC_WR_CRC_HU(base, value) (CRC_RMW_CRC(base, CRC_CRC_HU_MASK, CRC_CRC_HU(value)))
#define CRC_BWR_CRC_HU(base, value) (CRC_WR_CRC_HU(base, value))
/*@}*/

/*******************************************************************************
 * CRC_CRCLU - CRC_CRCLU register.
 ******************************************************************************/

/*!
 * @brief CRC_CRCLU - CRC_CRCLU register. (RW)
 *
 * Reset value: 0xFFU
 */
/*!
 * @name Constants and macros for entire CRC_CRCLU register
 */
/*@{*/
#define CRC_RD_CRCLU(base)       (CRC_CRCLU_REG(base))
#define CRC_WR_CRCLU(base, value) (CRC_CRCLU_REG(base) = (value))
#define CRC_RMW_CRCLU(base, mask, value) (CRC_WR_CRCLU(base, (CRC_RD_CRCLU(base) & ~(mask)) | (value)))
#define CRC_SET_CRCLU(base, value) (CRC_WR_CRCLU(base, CRC_RD_CRCLU(base) |  (value)))
#define CRC_CLR_CRCLU(base, value) (CRC_WR_CRCLU(base, CRC_RD_CRCLU(base) & ~(value)))
#define CRC_TOG_CRCLU(base, value) (CRC_WR_CRCLU(base, CRC_RD_CRCLU(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CRC_CRCHL - CRC_CRCHL register.
 ******************************************************************************/

/*!
 * @brief CRC_CRCHL - CRC_CRCHL register. (RW)
 *
 * Reset value: 0xFFU
 */
/*!
 * @name Constants and macros for entire CRC_CRCHL register
 */
/*@{*/
#define CRC_RD_CRCHL(base)       (CRC_CRCHL_REG(base))
#define CRC_WR_CRCHL(base, value) (CRC_CRCHL_REG(base) = (value))
#define CRC_RMW_CRCHL(base, mask, value) (CRC_WR_CRCHL(base, (CRC_RD_CRCHL(base) & ~(mask)) | (value)))
#define CRC_SET_CRCHL(base, value) (CRC_WR_CRCHL(base, CRC_RD_CRCHL(base) |  (value)))
#define CRC_CLR_CRCHL(base, value) (CRC_WR_CRCHL(base, CRC_RD_CRCHL(base) & ~(value)))
#define CRC_TOG_CRCHL(base, value) (CRC_WR_CRCHL(base, CRC_RD_CRCHL(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CRC_CRCH - CRC_CRCH register.
 ******************************************************************************/

/*!
 * @brief CRC_CRCH - CRC_CRCH register. (RW)
 *
 * Reset value: 0xFFFFU
 */
/*!
 * @name Constants and macros for entire CRC_CRCH register
 */
/*@{*/
#define CRC_RD_CRCH(base)        (CRC_CRCH_REG(base))
#define CRC_WR_CRCH(base, value) (CRC_CRCH_REG(base) = (value))
#define CRC_RMW_CRCH(base, mask, value) (CRC_WR_CRCH(base, (CRC_RD_CRCH(base) & ~(mask)) | (value)))
#define CRC_SET_CRCH(base, value) (CRC_WR_CRCH(base, CRC_RD_CRCH(base) |  (value)))
#define CRC_CLR_CRCH(base, value) (CRC_WR_CRCH(base, CRC_RD_CRCH(base) & ~(value)))
#define CRC_TOG_CRCH(base, value) (CRC_WR_CRCH(base, CRC_RD_CRCH(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * CRC_CRCHU - CRC_CRCHU register.
 ******************************************************************************/

/*!
 * @brief CRC_CRCHU - CRC_CRCHU register. (RW)
 *
 * Reset value: 0xFFU
 */
/*!
 * @name Constants and macros for entire CRC_CRCHU register
 */
/*@{*/
#define CRC_RD_CRCHU(base)       (CRC_CRCHU_REG(base))
#define CRC_WR_CRCHU(base, value) (CRC_CRCHU_REG(base) = (value))
#define CRC_RMW_CRCHU(base, mask, value) (CRC_WR_CRCHU(base, (CRC_RD_CRCHU(base) & ~(mask)) | (value)))
#define CRC_SET_CRCHU(base, value) (CRC_WR_CRCHU(base, CRC_RD_CRCHU(base) |  (value)))
#define CRC_CLR_CRCHU(base, value) (CRC_WR_CRCHU(base, CRC_RD_CRCHU(base) & ~(value)))
#define CRC_TOG_CRCHU(base, value) (CRC_WR_CRCHU(base, CRC_RD_CRCHU(base) ^  (value)))
/*@}*/

